app/controllers/users_controller.rb

  def login_attempt
    reto = {}
    if User.exists?(username: params[:user][:username])
      salt = get_salt()
      # format.json {  render :json => @authorized_user}
      encrypted_password = (Digest::MD5.hexdigest ( salt + get_pepper() + params[:user][:password].to_s)).to_s

      if User.exists?(username: params[:user][:username], password: encrypted_password)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["username", "arman"]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "popo"]]
SELECT  1 AS one FROM "users" WHERE "users"."password" = ? AND "users"."username" IS NULL LIMIT 1  [["password", "$2a$10$JCQdl06sBDeS1ysDJoXG9.qgqEgMzFMZh7RFOwvtqtjlN0Fs3qj/a"]]

  def create

    @user = User.new(user_params)
    @user.salt = create_salt()

    encrypted_password = (Digest::MD5.hexdigest ( @user.salt + get_pepper() + @user['password'].to_s )).to_s
    @user['password'] = encrypted_password

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("firstname", "lastname", "password", "email", "username", "salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)